Repository: NamelessOne91/uyuni-tools
Catalog: locale/mgradm/*.po
Languages: fr

source: Unable to unmount ISO image, leaving %s intact
fr: Impossible de démonter l'image ISO, %s laissée intacte

source: unable to login and register the distribution. Manual distro registration is required: %s
fr: impossible de se connecter et enregistrer la distribution. Un enregistrement manuel de la distribution est nécessaire: %s

source: unable to register the distribution. Manual distro registration is required: %s
fr: impossible d'enregistrer la distribution. Un enregistrement manuel de la distribution est nécessaire: %s

source: Distribution %s successfully registered
fr: Distribution %s enregistrée avec succès

source: Copying distribution %s
fr: Copie de la distribution %s

source: source %s does not exists
fr: la source %s n'existe pas

source: distribution already exists: %s
fr: distribution déjà existante: %s

source: unable to mount ISO image. Mount manually and try again
fr: impossible de monter l'image ISO. Montez-la manuellement et réessayez

source: cannot copy %s: %s
fr: impossible de copier %s: %s

source: Distribution has been copied
fr: La distribution a été copiée

source: unknown distribution, auto-registration is not possible
fr: distribution inconnue, enregistrement automatique impossible

source: Distributions management
fr: Gestion de distributions

source: Tools for autoinstallation distributions management
fr: Outils pour la gestion de distributions d'installation automatique

source: Copy distribution files from ISO image to the container
fr: Copier les fichiers de distribution d'une image ISO dans le conteneur

source: Takes a path to an ISO file or the directory of a mounted ISO image and copies it into the container. Distribution name specifies the destination directory under /srv/www/distributions. Optional channel label specify which parent channel to associate with the distribution. Only when API informations are provided and auto registration is done.
fr: Prend le chemin d'un fichier iso ou d'un répertoire d'image ISO mountée et le copie dans le conteneur. Le nom de la distribution indique le répertoire de destination dans /srv/www/distributions. L'étiquette optionnelle de canal indique le canal parent à associer à la dstribution. Seulement lorsque les informations d'API sont fournies et lors de l'enregistrement automatique.

source: Install a new server on a kubernetes cluster
fr: Installer un nouveau server sur un cluster kubernetes

source: Install a new server on a kubernetes cluster The install command assumes the following: * kubectl and helm are installed locally * a working kubectl configuration should be set to connect to the cluster to deploy to The helm values file will be overridden with the values from the command parameters or configuration. NOTE: installing on a remote cluster is not supported yet!
fr: Installer un nouveau server sur un cluster kubernetes La commande install suppose ce qui suit: * kubectl et helm sont installés locallement * une configuration kubectl doit être définie pour se connecter au cluster sur lequel déployer Le fichier de valeurs helm sera surchargé par les valeurs provenant des paramètres de mgradm ou sa configuration. NOTE: pour l'instant l'installation sur un cluster distant n'est pas supportée!

source: install %s before running this command
fr: installer %s avant d'exécuter cette commande

source: cannot deploy certificate: %s
fr: impossible de déployer le certificat: %s

source: cannot deploy uyuni: %s
fr: impossible de déployer uyuni: %s

source: error storing the SSL CA certificate in database: %s
fr: erreur lors de l'enregistrement du certificat de l'autorité de certification SSL dans la base de données: %s

source: Install a new server on podman
fr: Installer un nouveau serveur sur podman

source: Install a new server on podman The install podman command assumes podman is installed locally. NOTE: installing on a remote podman is not supported yet!
fr: Installer un nouveau server sur podman La commande install podman suppose que podman est installé locallement. NOTE: pour l'instant l'installation sur un podman distant n'est pas supportée!

source: cannot enable service: %s
fr: impossible d'activer le service systemd: %s

source: install podman before running this command
fr: installer podman avant d'exécuter cette commande

source: cannot inspect host values: %s
fr: impossible d'inspecter les valeurs de l'hôte: %s

source: Setting up the server with the FQDN '%s'
fr: Installation du serveur avec le FQDN '%s'

source: failed to compute image URL: %s
fr: impossible de calculer l'URL de l'image: %s

source: cannot wait for system start: %s
fr: impossible d'attendre le démarrage du système: %s

source: Run setup command in the container
fr: Exécution de l'installation dans le conteneur

source: cannot update SSL certificate: %s
fr: impossible de mettre à jour le certificat SSL: %s

source: cannot enable podman socket: %s
fr: impossible d'activer le socket podman: %s

source: failed to compute server FQDN: %s
fr: impossible de déterminer le FQDN du serveur: %s

source: cannot copy /tmp/setup.sh: %s
fr: impossible de copyer /tmp/setup.sh: %s

source: error running the setup script: %s
fr: erreur lors de l'exécution du script d'installation: %s

source: Server set up
fr: Installation du serveur

source: Failed to create temporary directory
fr: Échec de création du répertoire temporaire

source: Failed to generate setup script
fr: Impossible de générer le script d'installation

source: Can only contain letters, digits . _ and -
fr: Ne peut contenir que des lettres, chiffres . _ et -

source: Not a valid email address
fr: Pas une adresse email valide

source: Time zone to set on the server. Defaults to the host timezone
fr: Zone horaire à définir pour le serveur. Celle de l'hôte par défaut

source: Administrator e-mail
fr: E-mail de l'administrateur

source: E-Mail sending the notifications
fr: E-mail pour l'envoi des notifications

source: Path to mirrored packages mounted on the host
fr: Chemin vers le montage du mirroir paquets sur l'hôte

source: InterServerSync v1 parent FQDN
fr: FQDN du parent InterServerSync v1

source: Database user
fr: Utilisateur de la base de données

source: Database password. Randomly generated by default
fr: Mot de passe de la base de données. Valeur aléatoire par défaut

source: Database name
fr: Nom de la base de données

source: Database host
fr: Hôte de la base de données

source: Database port
fr: Port de la base de données

source: Database protocol
fr: Protocole de la base de données

source: External database admin user name
fr: Nom d'utilisateur administrateur de la base de données externe

source: External database admin password
fr: Mot de passe administrateur de la base de données externe

source: External database provider. Possible values 'aws'
fr: Fournisseur de base de données externe. Valeurs possibles 'aws'

source: Enable TFTP
fr: Activer TFTP

source: Report database name
fr: Nom de la base de données de rapport

source: Report database host
fr: Hôte de la base de données de rapport

source: Report database port
fr: Port de la base de données de rapport

source: Report Database username
fr: Nom d'utilisateur de la base de données de rapport

source: Report database password. Randomly generated by default
fr: Mot de passe de la base de données de rapport. Valeur aléatoire par défaut

source: SSL certificate cnames separated by commas
fr: Cnames de certificat SSL séparés par des virgules

source: SSL certificate country
fr: Pays du certificat SSL

source: SSL certificate state
fr: État du certificat SSL

source: SSL certificate city
fr: Ville du certificat SSL

source: SSL certificate organization
fr: Organisation du certificat SSL

source: SSL certificate organization unit
fr: Unité d'organisation du certificat SSL

source: Password for the CA key to generate
fr: Mot de passe de la clé de l'autorité de certification à générer

source: SSL certificate E-Mail
fr: E-mail du certificat SSL

source: Intermediate CA certificate path
fr: Chemin vers un certificat d'autorité de certification intermédiaire

source: Root CA certificate path
fr: Chemin vers le certificat de l'autorité de certification racine

source: Server certificate path
fr: Chemin vers le certificat du serveur

source: Server key path
fr: Chemin vers la clé du serveur

source: SUSE Customer Center username
fr: Nom d'utilisateur du SUSE Customer Center

source: SUSE Customer Center password
fr: Mot de passe du SUSE Customer Center

source: Enable tomcat and taskomatic remote debugging
fr: Activer le déboggage à distance de tomcat et taskomatic

source: Administrator user name
fr: Nom d'utilisateur de l'administrateur

source: Administrator password
fr: Mot de passe de l'administrateur

source: First name of the administrator
fr: Prénom de l'administrateur

source: Last name of the administrator
fr: Nom de l'administrateur

source: Administrator's email
fr: E-mail de l'administrateur

source: First organization name
fr: Nom de la première organisation

source: Install a new server
fr: Installer un nouveau serveur sur podman

source: Migrate a remote server to containers running on a kubernetes cluster
fr: Migrer un serveur distant vers des conteneurs sur un cluster kubernetes existant

source: Migrate a remote server to containers running on a kubernetes cluster This migration command assumes a few things: * the SSH configuration for the source server is complete, including user and all needed options to connect to the machine, * an SSH agent is started and the key to use to connect to the server is added to it, * kubectl and helm are installed locally, * a working kubectl configuration should be set to connect to the cluster to deploy to When migrating a server with a automatically generated SSL Root CA certificate, the private key password will be required to convert it to RSA in a kubernetes secret. This is not needed if the source server does not have a generated SSL CA certificate. NOTE: migrating to a remote cluster is not supported yet!
fr: Migrer un serveur distant vers des conteneurs sur un cluster kubernetes existant Cette commande suppose ce qui suit: * la configuration de SSH pour le serveur source doit être complète, incluant l'utilisateur et toutes les options nécessaires pour se connecter à la machine, * un agent SSH est démarré et la clé à utiliser pour se connecter au serveur y est chargée, * kubectl et helm sont installés localement, * une configuration kubectl doit être définie pour se connecter au cluster vers lequel déployer Lors de la migration d'un serveur avec une autorité de certification SSL racine générée automatiquement, le mot de passe de la clé privée sera nécessaire pour la convertir en RSA dans un secret kubernetes. Ceci n'est pas nécessaire si le serveur source n'a pas d'autorité de certification SSL générée. NOTE: pour l'instant la migration version un cluster distant n'est pas supportée!

source: SSL CA generated private key password
fr: Mot de passe de la clé privée de l'autorité de certification SSL générée

source: failed to generate migration script: %s
fr: impossible de générer le script de migration: %s

source: cannot run deploy: %s
fr: impossible d'exécuter le déploiement: %s

source: cannot find node running uyuni: %s
fr: impossible de trouver le noeud sur lequel uyuni est exécuté: %s

source: cannot run migration: %s
fr: impossible d'effectuer la migration: %s

source: cannot read data from container: %s
fr: impossible de lire les données du conteneur: %s

source: cannot set replicas to 0: %s
fr: impossible de mettre le nombre de répliques à 0: %s

source: cannot setup SSL: %s
fr: impossible de configurer SSL: %s

source: cannot upgrade helm chart to image %s using new SSL certificate: %s
fr: impossible de mettre à jour le helm chart pour l'image %s en utilisant le nouveau certificat SSL: %s

source: cannot wait for deployment of %s: %s
fr: impossible d'attendre le déploiement de %s: %s

source: cannot run PostgreSQL version upgrade script: %s
fr: impossible d'exécuter le script de mise à jour de la version de PostgreSQL: %s

source: cannot run post upgrade script: %s
fr: impossible d'exécuter le script post mise à jour: %s

source: cannot upgrade to image %s: %s
fr: impossible de mettre à jour avec l'image %s: %s

source: failed to strip text part from CA certificate: %s
fr: impossible de supprimer la partie text du certificat de l'autorité de certification: %s

source: Migrate a remote server to containers running on podman
fr: Migrer un serveur distant vers des conteneurs sur podman

source: Migrate a remote server to containers running on podman This migration command assumes a few things: * the SSH configuration for the source server is complete, including user and all needed options to connect to the machine, * an SSH agent is started and the key to use to connect to the server is added to it, * podman is installed locally NOTE: migrating to a remote podman is not supported yet!
fr: Migrer un serveur distant vers des conteneurs sur podman Cette commande suppose ce qui suit: * la configuration de SSH pour le serveur source doit être complète, incluant l'utilisateur et toutes les options nécessaires pour se connecter à la machine, * un agent SSH est démarré et la clé à utiliser pour se connecter au serveur y est chargée, * kubectl et helm sont installés localement NOTE: pour l'instant la migration version un cluster distant n'est pas supportée!

source: cannot compute image: %s
fr: impossible de déterminer l'image: %s

source: cannot run migration script: %s
fr: impossible d'exécuter le script de migration: %s

source: Previous PostgreSQL is %s, new one is %s. Performing a DB version upgrade...
fr: Le PostgreSQL précédent est %s, le nouveau est %s. Mise à jour de la version de la base de données...

source: cannot run PostgreSQL finalize script: %s
fr: impossible d'exécuter le script de finalisation de PostgreSQL: %s

source: cannot generate systemd service file: %s
fr: impossible de générer le fichier du service systemd: %s

source: Server migrated
fr: Serveur migré

source: SSH_AUTH_SOCK is not defined, start an SSH agent and try again
fr: SSH_AUTH_SOCK n'est pas défini, démarrer un agent SSH et réessayer

source: Failed to find home directory to look for SSH config
fr: Impossible de trouver le répertoire home pour chercher la configuration SSH

source: Migrate a remote server to containers
fr: Migrer un serveur distant vers des conteneurs

source: cannot delete volume %s: %s
fr: impossible de supprimer le volue %s: %s

source: All volumes removed
fr: Tous les volumes ont été supprimés

source: Would run %s
fr: Exécuterait %s

source: Running %s
fr: Exécute %s

source: Failed deleting config map
fr: Impossible de supprimer la config map

source: Failed deleting secret
fr: Impossible de supprimer le secret

source: Uninstall a server
fr: Désinstaller un serveur

source: Uninstall a server and optionally the corresponding volumes. By default it will only print what would be done, use --force to actually remove.
fr: Désinstaller un serveur et optionnellement les volumes associés. By default it will only print what would be done, use --force to actually remove.

source: Actually remove the server
fr: Réellement supprimer le serveur

source: Also remove the volumes
fr: Supprimer également les volumes

source: failed to create temporary directory: %s
fr: impossible de créér le répertoire temporaire: %s

source: Running supportconfig in the container
fr: Exécution de supportconfig dans le conteneur

source: failed to run supportconfig
fr: impossible d'exécuter supportconfig

source: failed to find container supportconfig tarball from command output
fr: impossible de trouver l'archive du supportconfig du conteneur à partir de la sortie de la commande

source: cannot copy tarball: %s
fr: impossible de copier l'archive: %s

source: failed to remove %s%s file in the container: %s
fr: impossible de supprimer le fichier %s%s dans le conteneur: %s

source: failed to run supportconfig on the host: %s
fr: impossible de trouver supportconfig sur l'hôte: %s

source: failed to find host supportconfig tarball from command output
fr: impossible de trouver l'archive du supportconfig de l'hôte à partir de la sortie de la commande

source: supportconfig is not available on the host, skipping it
fr: supportconfig n'est pas disponible sur l'hôte, passé

source: Preparing the tarball
fr: Préparation de l'archive

source: failed to add %s to tarball: %s
fr: impossible d'ajouter %s à l'archive: %s

source: Extract configuration and logs
fr: Extraire la configuration et les logs

source: Extract the host or cluster configuration and logs as well as those from the containers for support to help debugging.
fr: Extraire la configuration de l'hôte ou du cluster et les logs ainsi que ceux des conteneurs pour aider le support à débugguer.

source: path where to extract the data
fr: chemin vers lequel extraire les données

source: Commands for support operations
fr: Commandes pour les opérations de support

source: Restart the server
fr: Redémarrer le serveur

source: built without kubernetes support
fr: compilé sans support de kubernetes

source: Start the server
fr: Démarrer le serveur

source: Stop the server
fr: Arrêter le serveur

source: Inspect
fr: Inspecter

source: Extract information from image and deployment
fr: Extrait des informations sur l'image et le déploiement

source: Image URL. Leave it empty to analyze the current deployment
fr: URL de l'image. Laisser vide pour analyser le déploiement actuel

source: Image Tag. Leave it empty to analyze the current deployment
fr: Tag de l'image. Laisser vide pour analyser le déploiement actuel

source: failed to determine image: %s
fr: impossible de déterminer l'image: %s

source: failed to find the image of the currently running server container: %s
fr: impossible de déterminer l'image du conteneur actuel du serveur: %s

source: inspect command failed: %s
fr: la commande inspect a échoué: %s

source: cannot print inspect result: %s
fr: impossible d'afficher le résultat de l'inspection: %s

source: cannot set replica to 0: %s
fr: impossible de mettre le nombre de répliques à 0: %s

source: Uyuni administration tool
fr: Outil d'administration d'Uyuni

source: Tool to help administering Uyuni servers in containers
fr: Outil pour aider à administrer des serveurs Uyuni dans des conteneurs

source: Welcome to %s
fr: Bienvenue à %s

source: Executing command: %s
fr: Exécution de la commande: %s

source: configuration file path
fr: chemin vers le fichier de configuration

source: application log level
fr: niveau de verbosité de l'application

source: Creating SSL server certificate secret
fr: Création du certificat SSL du serveur

source: Failed to generate uyuni-crt secret definition
fr: Impossible de générer la définition du secret uyuni-crt

source: Failed to create uyuni-crt TLS secret
fr: Impossible de créer le secret TLS uyuni-crt

source: cannot install cert manager: %s
fr: impossible d'installer cert manager: %s

source: failed to generate issuer definition: %s
fr: impossible de générer la définition de l'issuer: %s

source: Failed to create issuer
fr: Impossible de créer l'issuer

source: Issuer didn't turn ready after 60s
fr: L'issuer n'est pas devenu prêt après 60s

source: Installing cert-manager
fr: Installation de cert-manager

source: cannot run helm upgrade: %s
fr: impossible d'exécuter helm upgrade: %s

source: cannot deploy: %s
fr: impossible d'exécuter le déploiement: %s

source: Extracting CA certificate to a configmap
fr: Extraction du certificat de l'autorité de certification dans une configmap

source: uyuni-ca configmap already existing, skipping extraction
fr: La configmap uyuni-ca existe déjà, extraction passée

source: Failed to get uyuni-ca certificate
fr: Impossible d'obtenir le certificate uyuni-ca

source: Failed to base64 decode CA certificate
fr: Impossible de décoder le base64 du certificat de l'autorité de certification

source: Failed to create uyuni-ca config map from certificate
fr: Impossible de créer la config map uyuni-ca à partir du certificat

source: cannot upgrade: %s
fr: impossible de mettre à jour: %s

source: cannot install cert-manager and self-sign issuer: %s
fr: impossible d'installer cert-manager et l'issuer auto-signé: %s

source: Installing Uyuni
fr: Installation d'Uyuni

source: Using migration image %s
fr: Utilisation de l'image de migration %s

source: cannot generate PostgreSQL database version upgrade script: %s
fr: impossible d'exécuter le script de mise à jour de la version de PostgreSQL: %s

source: error running container %s: %s
fr: erreur lors de l'exécution du conteneur %s: %s

source: cannot generate PostgreSQL finalization script %s
fr: impossible d'exécuter le script de finalisation de PostgreSQL: %s

source: cannot setup network: %s
fr: impossible de configurer le réseau: %s

source: failed to generate systemd service unit file: %s
fr: impossible de générer le fichier du service systemd: %s

source: cannot generate systemd conf file: %s
fr: impossible de générer le fichier de configuration du service systemd: %s

source: failed to create temporary folder on container to copy certificates to
fr: impossible de créér le répertoire temporaire dans lequel coper les certificats: %s

source: failed to update SSL certificate
fr: impossible de mettre à jour le certificat SSL: %s

source: failed to remove copied certificate files in the container
fr: impossible de copier les fichiers du certificat dans le conteneur

source: failed to remove now useless ssl-build folder in the container
fr: impossible de supprimer le répertoire ssl-build devenu inutile dans le conteneur

source: failed to run %s container: %s
fr: impossible d'exécuter le conteneur %s: %s

source: cannot generate migration script: %s
fr: impossible de générer le script de migration: %s

source: cannot run uyuni migration container: %s
fr: impossible d'exécuter le conteneur de migration: %s

source: cannot read extracted data: %s
fr: impossible de lire les données extraites: %s

source: cannot generate PostgreSQL database version upgrade script %s
fr: impossible de générer le script de mise à jour de la version de PostgreSQL: %s

source: cannot generate PostgreSQL finalization script: %s
fr: impossible de générer le script de finalisation de PostgreSQL: %s

source: Failed to find a non-CA certificate
fr: Impossible de trouver un certificat qui ne soit pas une autorité de certification

source: expected to find a certificate, got none
fr: certificat attendu, aucun trouvé

source: Failed to read certificate file %s
fr: Impossible de lire le fichier de certificat %s

source: Failed to extract data from certificate
fr: Impossible d'extraire les données du certificat

source: Failed to parse start date: %s
fr: Impossible lire la date de début: %s

source: Failed to parse end date: %s
fr: Impossible de lire la date de fin: %s

source: No CA found
fr: Aucune autorité de certification trouvée

source: No CA found for server certificate
fr: Aucune autorité de certification trouvée pour le certificat du serveur

source: Missing CA with subject hash %s
fr: Autorité de certification avec hachage du sujet %s manquante

source: server certificate is required
fr: certificat du serveur nécessaire

source: server key is required
fr: la clé du serveur est nécessaire

source: %s file is not accessible
fr: le fichier %s n'est pas accessible

source: Source server SSL CA private key password
fr: Mot de passe de la clé privée de l'autorité de certification SSL source

source: Failed to convert CA private key to RSA
fr: Echec de conversion de la clé privée de l'autorité de certification en RSA

source: exec command failed: %s
fr: la commande exec a échoué: %s

source: failed to generate %s
fr: impossible de générer %s
