Repository: NamelessOne91/uyuni-tools
Catalog: locale/mgradm/*.po
Languages: fr

source: failed to read data extracted from source host
fr: impossible de lire les données extraites de l'hôte source

source: cannot read config: %s
fr: impossible de lire la configuration: %s

source: cannot retrieve timezone
fr: impossible d'obtenir la zone horaire

source: cannot retrieve source PostgreSQL version
fr: impossible d'obtenir la version de PostgreSQL sur le serveur d'origine: %s

source: cannot retrieve image PostgreSQL version
fr: impossible d'obtenir la version de PostgreSQL sur l'image: %s

source: error running the migration script: %s
fr: erreur lors de l'exécution du script de migration: %s

source: cannot parse file %s: %s
fr: impossible d'analyser le fichier %s: %s

source: failed to run inspect script in host system: %s
fr: impossible d'exécuter le script d'inspection sur le système hôte: %s

source: cannot inspect host data: %s
fr: impossible d'inspecter les valeurs de l'hôte: %s

source: failed to generate inspect script: %s
fr: impossible de générer le script d'inspection: %s
